Revit 2027 API
StructuralSettings.BraceAboveSymbol Property
 The id of the ElementType to represent a brace above a beam in plan view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BraceAboveSymbol { get; set; }
Public Property BraceAboveSymbol As ElementId
	Get
	Set
public:
property ElementId^ BraceAboveSymbol {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BraceAboveSymbol : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace